[
  {
    "title": "1984",
    "summary": "George Orwell's '1984' is a profound dystopian novel that explores the dangers of totalitarianism. Set in the fictional superstate of Oceania, it follows Winston Smith, a low-ranking member of the Party who works at the Ministry of Truth, rewriting historical records to match the government's narrative. Disillusioned by the regime's absolute control over thought and behavior, Winston begins a forbidden relationship and seeks out truth in a world dominated by surveillance, propaganda, and the Thought Police. The novel examines themes of identity, freedom, manipulation, and the terrifying consequences of unchecked political power."
  },
  {
    "title": "The Hobbit",
    "summary": "J.R.R. Tolkien’s 'The Hobbit' tells the tale of Bilbo Baggins, a peaceful hobbit whose quiet life is disrupted when the wizard Gandalf and thirteen dwarves recruit him for an epic quest to reclaim the dwarves' homeland and treasure from the dragon Smaug. Along the way, Bilbo encounters trolls, goblins, elves, and Gollum, from whom he acquires the One Ring. Through moments of fear and bravery, Bilbo evolves from a reluctant traveler into a cunning and courageous hero. The story explores themes of adventure, personal growth, and the unexpected strength within ordinary individuals."
  },
  {
    "title": "To Kill a Mockingbird",
    "summary": "Harper Lee's 'To Kill a Mockingbird' is set in the segregated American South during the 1930s and narrated by young Scout Finch. As Scout grows up, she witnesses her father, Atticus Finch, defend Tom Robinson, a Black man falsely accused of raping a white woman. The trial and its aftermath reveal the deep-rooted racism and injustice in their community. The novel is a poignant exploration of innocence, moral integrity, and the importance of empathy in the face of prejudice and societal inequality."
  },
  {
    "title": "Pride and Prejudice",
    "summary": "Jane Austen's novel follows Elizabeth Bennet as she navigates issues of manners, morality, and marriage in early 19th-century England. Elizabeth's wit and independence challenge societal expectations, especially in her evolving relationship with the proud but honorable Mr. Darcy. Through misunderstandings and personal growth, the characters confront their biases and learn the value of mutual respect and love."
  },
  {
    "title": "The Catcher in the Rye",
    "summary": "J.D. Salinger’s classic captures the voice of disillusioned teenager Holden Caulfield as he wanders New York City. Grieving the death of his brother and expelled from school, Holden confronts loneliness, hypocrisy, and his own fear of adulthood. The novel is a raw exploration of adolescent identity, alienation, and the struggle to preserve innocence."
  },
  {
    "title": "Brave New World",
    "summary": "Aldous Huxley’s 'Brave New World' envisions a futuristic society where people are genetically engineered and conditioned for conformity. Pleasure, consumerism, and the suppression of individuality dominate. Bernard Marx, feeling out of place, questions the cost of a utopia that sacrifices freedom and emotion. The novel critiques blind technological advancement and the erosion of humanity."
  },
  {
    "title": "The Great Gatsby",
    "summary": "F. Scott Fitzgerald’s 'The Great Gatsby' delves into the glittering yet hollow world of the Roaring Twenties. Narrated by Nick Carraway, the novel centers on the mysterious millionaire Jay Gatsby and his obsession with the unattainable Daisy Buchanan. It examines themes of illusion, social decay, and the elusive nature of the American Dream."
  },
  {
    "title": "Jane Eyre",
    "summary": "Charlotte Brontë’s 'Jane Eyre' follows a strong-willed orphan who overcomes adversity to become a governess at Thornfield Hall. There, she falls in love with the brooding Mr. Rochester, whose hidden secrets test Jane’s integrity and strength. The novel emphasizes autonomy, morality, and enduring love in the face of social constraints."
  },
  {
    "title": "Lord of the Flies",
    "summary": "William Golding’s 'Lord of the Flies' portrays a group of boys stranded on an uninhabited island, who gradually descend into savagery. Without adult supervision, their society breaks down as fear and power struggles take hold. The novel is a haunting study of human nature, civilization, and the thin veneer of order."
  },
  {
    "title": "Animal Farm",
    "summary": "George Orwell's allegorical novella tells of a group of farm animals who overthrow their human oppressor to establish an egalitarian society. However, the pigs, led by Napoleon, become corrupt and tyrannical. The story is a critique of totalitarianism, power, and the betrayal of revolutionary ideals."
  },
  {
    "title": "Little Women",
    "summary": "Louisa May Alcott's 'Little Women' follows the four March sisters—Meg, Jo, Beth, and Amy—through adolescence into adulthood during the Civil War. Each sister pursues her own dreams amid struggles of love, ambition, and loss. The novel celebrates family bonds, personal growth, and the pursuit of happiness."
  },
  {
    "title": "Crime and Punishment",
    "summary": "Fyodor Dostoevsky’s 'Crime and Punishment' follows Raskolnikov, a destitute student who murders a pawnbroker to test his theory of moral superiority. As guilt consumes him, he confronts psychological torment and seeks redemption. The novel explores justice, morality, and the depths of human conscience."
  },
  {
    "title": "The Alchemist",
    "summary": "Paulo Coelho's 'The Alchemist' tells the story of Santiago, a shepherd who dreams of finding treasure in the Egyptian pyramids. Guided by omens and wise mentors, he embarks on a journey of self-discovery. The novel emphasizes listening to one’s heart, the pursuit of dreams, and the unity of all things."
  },
  {
    "title": "The Book Thief",
    "summary": "Markus Zusak’s 'The Book Thief' is set in Nazi Germany and narrated by Death. It follows Liesel Meminger, a girl who steals books and finds solace in words during a time of great darkness. As war ravages her town, Liesel's story highlights the resilience of the human spirit and the power of storytelling."
  },
  {
    "title": "Frankenstein",
    "summary": "Mary Shelley’s 'Frankenstein' tells of Victor Frankenstein, a scientist who creates a living being from dead tissue. The creature, intelligent and sensitive, is shunned and becomes vengeful. The novel explores the dangers of unchecked ambition, the search for identity, and the responsibility of the creator."
  },
  {
    "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
    "summary": "C.S. Lewis's fantasy novel introduces four siblings who discover the magical land of Narnia. With the help of the lion Aslan, they battle the White Witch’s eternal winter. The story celebrates courage, redemption, and the triumph of good over evil."
  },
  {
    "title": "Wuthering Heights",
    "summary": "Emily Brontë’s 'Wuthering Heights' tells of the turbulent love between Heathcliff and Catherine Earnshaw on the Yorkshire moors. Their obsession leads to revenge and suffering that spans generations. The novel is a gothic exploration of passion, pride, and the destructive power of unresolved emotions."
  },
  {
    "title": "Slaughterhouse-Five",
    "summary": "Kurt Vonnegut’s novel blends science fiction and anti-war satire through the experiences of Billy Pilgrim, a soldier who becomes 'unstuck in time.' Surviving the Dresden bombing, Billy drifts through moments of his life, questioning reality, war, and free will."
  },
  {
    "title": "Of Mice and Men",
    "summary": "John Steinbeck's novella follows George and Lennie, two displaced laborers in Depression-era California. Lennie's mental disability and immense strength create tension as they dream of owning land. The story is a tragic tale of friendship, hope, and the harshness of the American dream."
  },
  {
    "title": "Fahrenheit 451",
    "summary": "Ray Bradbury's 'Fahrenheit 451' envisions a future where books are banned and 'firemen' burn them. Guy Montag, a fireman, begins questioning this reality and seeks knowledge in secret. The novel explores censorship, conformity, and the transformative power of literature."
  },
  {
    "title": "The Giver",
    "summary": "Lois Lowry’s 'The Giver' introduces Jonas, who lives in a society stripped of pain, color, and emotion. When chosen to receive memories from the Giver, he learns the cost of their utopia. The story is a powerful reflection on individuality, memory, and the human experience."
  },
  {
    "title": "The Secret Garden",
    "summary": "Frances Hodgson Burnett’s classic follows Mary Lennox, a spoiled girl sent to live in her uncle’s estate. There, she discovers a neglected garden and unlocks healing and friendship. As she nurtures the garden, Mary transforms emotionally, learning compassion and love."
  }
]